{"source_doc": "Acceptable_Encryption_Standard.docx", "section": "General", "text": "Acceptable Encryption Standard", "nda_tier": "under-nda"}
{"source_doc": "Acceptable_Encryption_Standard.docx", "section": "General", "text": "Purpose", "nda_tier": "under-nda"}
{"source_doc": "Acceptable_Encryption_Standard.docx", "section": "General", "text": "The purpose of this policy is to provide guidance that limits the use of encryption to those algorithms that have received substantial public review and have been proven to work effectively. Additionally, this policy provides direction to ensure that Federal regulations are followed, and legal authority is granted for the dissemination and use of encryption technologies outside of the United States.", "nda_tier": "under-nda"}
{"source_doc": "Acceptable_Encryption_Standard.docx", "section": "General", "text": "Scope", "nda_tier": "under-nda"}
{"source_doc": "Acceptable_Encryption_Standard.docx", "section": "General", "text": "This policy applies to all <Company Name> employees and affiliates.", "nda_tier": "under-nda"}
{"source_doc": "Acceptable_Encryption_Standard.docx", "section": "General", "text": "Safeguards", "nda_tier": "under-nda"}
{"source_doc": "Acceptable_Encryption_Standard.docx", "section": "General", "text": "Algorithm Requirements", "nda_tier": "under-nda"}
{"source_doc": "Acceptable_Encryption_Standard.docx", "section": "General", "text": "Ciphers in use must meet or exceed the set defined as \"AES-compatible\" or \"partially AES-compatible\" according to the IETF/IRTF Cipher Catalog, or the set defined for use in the United States National Institute of Standards and Technology (NIST) publication FIPS 140-2, or any superseding documents according to the date of implementation. The use of the Advanced Encryption Standard (AES) is strongly recommended for symmetric encryption.", "nda_tier": "under-nda"}
{"source_doc": "Acceptable_Encryption_Standard.docx", "section": "General", "text": "Algorithms in use must meet the standards defined for use in NIST publication FIPS 140-2 or any superseding document, according to date of implementation. The use of the RSA and Elliptic Curve Cryptography (ECC) algorithms is strongly recommended for asymmetric encryption.", "nda_tier": "under-nda"}
{"source_doc": "Acceptable_Encryption_Standard.docx", "section": "General", "text": "Signature Algorithms", "nda_tier": "under-nda"}
{"source_doc": "Acceptable_Encryption_Standard.docx", "section": "General", "text": "Hash Function Requirements", "nda_tier": "under-nda"}
{"source_doc": "Acceptable_Encryption_Standard.docx", "section": "General", "text": "In general, <Company Name> adheres to the NIST Policy on Hash Functions.", "nda_tier": "under-nda"}
{"source_doc": "Acceptable_Encryption_Standard.docx", "section": "General", "text": "Key Agreement and Authentication", "nda_tier": "under-nda"}
{"source_doc": "Acceptable_Encryption_Standard.docx", "section": "General", "text": "Key exchanges must use one of the following cryptographic protocols: Diffie-Hellman, IKE, or Elliptic curve Diffie-Hellman (ECDH).", "nda_tier": "under-nda"}
{"source_doc": "Acceptable_Encryption_Standard.docx", "section": "General", "text": "End points must be authenticated prior to the exchange or derivation of session keys.", "nda_tier": "under-nda"}
{"source_doc": "Acceptable_Encryption_Standard.docx", "section": "General", "text": "Public keys used to establish trust must be authenticated prior to use. Examples of authentication include transmission via cryptographically signed message or manual verification of the public key hash.", "nda_tier": "under-nda"}
{"source_doc": "Acceptable_Encryption_Standard.docx", "section": "General", "text": "All servers used for authentication (for example, RADIUS or TACACS) must have installed a valid certificate signed by a known trusted provider.", "nda_tier": "under-nda"}
{"source_doc": "Acceptable_Encryption_Standard.docx", "section": "General", "text": "All servers and applications using SSL or TLS must have the certificates signed by a known, trusted provider.", "nda_tier": "under-nda"}
{"source_doc": "Acceptable_Encryption_Standard.docx", "section": "General", "text": "Key Generation", "nda_tier": "under-nda"}
{"source_doc": "Acceptable_Encryption_Standard.docx", "section": "General", "text": "Cryptographic keys must be generated and stored in a secure manner that prevents loss, theft, or compromise.", "nda_tier": "under-nda"}
{"source_doc": "Acceptable_Encryption_Standard.docx", "section": "General", "text": "Key generation must be seeded from an industry standard random number generator (RNG). For examples, see NIST Annex C: Approved Random Number Generators for FIPS PUB 140-2.", "nda_tier": "under-nda"}
{"source_doc": "Acceptable_Encryption_Standard.docx", "section": "General", "text": "Policy Sanctions", "nda_tier": "under-nda"}
{"source_doc": "Acceptable_Encryption_Standard.docx", "section": "General", "text": "Non-compliance with this policy may result in disciplinary action in line with our corporation's human resources procedures. Consequences may range from mandatory refresher training and written warnings to temporary suspension of remote access privileges and, in severe cases, termination of employment or contractual obligations. Individuals could be subject to legal consequences under applicable laws if violations involve illegal activities. These sanctions emphasize the critical importance of cybersecurity, the individual's role in protecting our digital assets, and the potential risks associated with policy violations. Enforcement will be consistent and impartial, with the severity of the action corresponding directly to the seriousness of the breach.", "nda_tier": "under-nda"}
{"source_doc": "Access_Management_Policy.docx", "section": "General", "text": "Access Management Policy", "nda_tier": "under-nda"}
{"source_doc": "Access_Management_Policy.docx", "section": "General", "text": "Purpose", "nda_tier": "under-nda"}
{"source_doc": "Access_Management_Policy.docx", "section": "General", "text": "Our Access Management Policy aims to establish a comprehensive framework for controlling and managing user access to our organization's systems, applications, and data resources. This policy aims to provide clear guidelines and procedures for granting, reviewing, and revoking access privileges, ensuring that users have the appropriate level of access based on their roles and responsibilities. This policy seeks to minimize the risk of unauthorized access, data breaches, and insider threats by implementing effective access management practices. By implementing strong authentication mechanisms, role-based access controls, and regular access reviews, we strive to ensure that only authorized individuals can access sensitive information, protect the confidentiality and integrity of our systems and data, and comply with regulatory requirements. By prioritizing access management, we", "nda_tier": "under-nda"}
{"source_doc": "Access_Management_Policy.docx", "section": "General", "text": "strengthen our overall cybersecurity posture, safeguard against unauthorized access, and maintain the trust and confidence of our stakeholders.", "nda_tier": "under-nda"}
{"source_doc": "Access_Management_Policy.docx", "section": "General", "text": "Scope", "nda_tier": "under-nda"}
{"source_doc": "Access_Management_Policy.docx", "section": "General", "text": "The Access Management Policy applies to all our organization's employees, contractors, and stakeholders. It encompasses managing and controlling user access privileges to systems, applications, and data resources within our IT infrastructure. This policy covers all accounts and credentials to authenticate and authorize individuals' access. It sets forth guidelines for user provisioning, role-based access control, and segregation of duties to ensure appropriate access levels are granted based on job responsibilities and the principle of least privilege. The policy defines user account creation, modification, and termination procedures, as well as password management, session management, and access revocation. It also outlines the responsibilities of individuals involved in access management processes, including system administrators, IT managers, and access administrators. Compliance with this policy is", "nda_tier": "under-nda"}
{"source_doc": "Access_Management_Policy.docx", "section": "General", "text": "mandatory for all individuals within the organization, and any deviations or exceptions require approval from the designated authority responsible for access management and cybersecurity governance.", "nda_tier": "under-nda"}
{"source_doc": "Access_Management_Policy.docx", "section": "General", "text": "Safeguards", "nda_tier": "under-nda"}
{"source_doc": "Access_Management_Policy.docx", "section": "General", "text": "To achieve the organization's overall mission, and the purpose of this cybersecurity policy, the organization shall:", "nda_tier": "under-nda"}
{"source_doc": "Access_Management_Policy.docx", "section": "General", "text": "AM-01 Define a process for creating and documenting roles and responsibilities for each of the organization's workforce members.", "nda_tier": "under-nda"}
{"source_doc": "Access_Management_Policy.docx", "section": "General", "text": "AM-02 Ensure that the organization's documented roles and responsibilities for workforce members consider the principle of separation of duties when defining roles.", "nda_tier": "under-nda"}
{"source_doc": "Access_Management_Policy.docx", "section": "General", "text": "AM-03 Maintain documented Access Control Lists (ACLs) for each computing system and business application system.", "nda_tier": "under-nda"}
{"source_doc": "Access_Management_Policy.docx", "section": "General", "text": "AM-04 Ensure that the organization's documented Access Control Lists (ACLs) for computing systems and business applications are based on the organization's defined roles for workforce members.", "nda_tier": "under-nda"}
{"source_doc": "Access_Management_Policy.docx", "section": "General", "text": "AM-05 Maintain Access Control Lists (ACLs) on computing system objects based on approved documentation, roles, and the principle of least privilege.", "nda_tier": "under-nda"}
{"source_doc": "Access_Management_Policy.docx", "section": "General", "text": "AM-06 Maintain Access Control Lists (ACLs) on computing system functions based on approved documentation, roles, and the principle of least privilege.", "nda_tier": "under-nda"}
{"source_doc": "Access_Management_Policy.docx", "section": "General", "text": "AM-07 Maintain Access Control Lists (ACLs) on code repositories based on approved documentation, roles, and the principle of least privilege.", "nda_tier": "under-nda"}
{"source_doc": "Access_Management_Policy.docx", "section": "General", "text": "AM-08 Ensure that the organization's Access Control Lists (ACLs) enforce encryption of data at rest on each of the organization's computing systems.", "nda_tier": "under-nda"}
{"source_doc": "Access_Management_Policy.docx", "section": "General", "text": "AM-09 Ensure that the organization's Access Control Lists (ACLs) enforce data encryption in transit on each computing system.", "nda_tier": "under-nda"}
{"source_doc": "Access_Management_Policy.docx", "section": "General", "text": "AM-10 Define a process for reviewing the organization's documented Access Control Lists (ACLs) on a regular basis.", "nda_tier": "under-nda"}
{"source_doc": "Access_Management_Policy.docx", "section": "General", "text": "AM-11 Define a process for reviewing the organization's Access Control List (ACL) documentation on a regular basis.", "nda_tier": "under-nda"}
{"source_doc": "Access_Management_Policy.docx", "section": "General", "text": "AM-12 Define a process the organization shall use to regularly review the organization's group or role membership used by the organization's Access Control Lists (ACLs) regularly.", "nda_tier": "under-nda"}
{"source_doc": "Access_Management_Policy.docx", "section": "General", "text": "AM-13 Ensure the organization's information systems log and alert changes to group or role memberships or configured Access Control Lists (ACLs).", "nda_tier": "under-nda"}
{"source_doc": "Access_Management_Policy.docx", "section": "General", "text": "AM-14 Ensure the organization's information systems log and alert changes to group or role memberships or configured Access Control Lists (ACLs).", "nda_tier": "under-nda"}
{"source_doc": "Access_Management_Policy.docx", "section": "General", "text": "Policy Sanctions", "nda_tier": "under-nda"}
{"source_doc": "Access_Management_Policy.docx", "section": "General", "text": "Non-compliance with this policy may result in disciplinary action in line with our corporation's human resources procedures. Consequences may range from mandatory refresher training and written warnings to temporary suspension of remote access privileges and, in severe cases, termination of employment or contractual obligations. Individuals could be subject to legal consequences under applicable laws if violations involve illegal activities. These sanctions emphasize the critical importance of cybersecurity, the individual's role in protecting our digital assets, and the potential risks associated with policy violations. Enforcement will be consistent and impartial, with the severity of the action corresponding directly to the seriousness of the breach.", "nda_tier": "under-nda"}
{"source_doc": "Asset_Management_Policy.docx", "section": "General", "text": "Asset Management Policy", "nda_tier": "under-nda"}
{"source_doc": "Asset_Management_Policy.docx", "section": "General", "text": "Purpose", "nda_tier": "under-nda"}
{"source_doc": "Asset_Management_Policy.docx", "section": "General", "text": "Our Asset Management Policy aims to establish a systematic and up-to-date inventory of all information technology assets within our organization, ensuring their proper management, monitoring, and protection. This policy provides clear guidelines and procedures for identifying, documenting, and tracking hardware, software, network devices, and other digital assets throughout their lifecycle. By implementing effective Asset Management practices, this policy seeks to enhance our visibility and understanding of our technology landscape, improve asset management, and strengthen cybersecurity controls. Through regular asset audits, vulnerability assessments, and risk assessments, we strive to identify and mitigate potential vulnerabilities, ensure timely patching and updates, and protect our systems, data, and networks from unauthorized access and potential threats. By prioritizing Asset Management, we enhance our overall cybersecurity", "nda_tier": "under-nda"}
{"source_doc": "Asset_Management_Policy.docx", "section": "General", "text": "posture, enable effective risk management, and maintain our critical assets' integrity, confidentiality, and availability.", "nda_tier": "under-nda"}
{"source_doc": "Asset_Management_Policy.docx", "section": "General", "text": "Scope", "nda_tier": "under-nda"}
{"source_doc": "Asset_Management_Policy.docx", "section": "General", "text": "The Asset Management Policy applies to all our organization's employees, contractors, and stakeholders and encompasses the systematic identification, tracking, and management of all information technology assets within our infrastructure. This policy covers hardware devices, software applications, network components, and data repositories. It establishes procedures for conducting regular asset inventories, maintaining accurate asset ownership and location records, and updating the inventory as new assets are acquired or retired. The policy sets forth guidelines for asset discovery and monitoring techniques to identify unauthorized or unmanaged assets within the organization's network. Compliance with this policy is mandatory for all individuals within the organization, and any deviations or exceptions require approval from the designated authority responsible for asset inventory and cybersecurity governance.", "nda_tier": "under-nda"}
{"source_doc": "Asset_Management_Policy.docx", "section": "General", "text": "Safeguards", "nda_tier": "under-nda"}
{"source_doc": "Asset_Management_Policy.docx", "section": "General", "text": "To achieve the organization's overall mission, and the purpose of this cybersecurity policy, the organization shall:", "nda_tier": "under-nda"}
{"source_doc": "Asset_Management_Policy.docx", "section": "General", "text": "AST-01 Maintain one centralized information system asset inventory tracking system to track each of the organization's logical computing information systems.", "nda_tier": "under-nda"}
{"source_doc": "Asset_Management_Policy.docx", "section": "General", "text": "AST-02 Ensure the organization's asset tracking system includes all endpoint computing devices (such as workstations or laptops), whether onsite or remote.", "nda_tier": "under-nda"}
{"source_doc": "Asset_Management_Policy.docx", "section": "General", "text": "AST-03 Ensure that the organization's asset tracking system includes all server computing devices (such as physical or virtualized server instances), whether onsite or remote.", "nda_tier": "under-nda"}
{"source_doc": "Asset_Management_Policy.docx", "section": "General", "text": "AST-04 Ensure the organization's asset tracking system includes all mobile computing devices (such as phones and tablets), whether onsite or remote.", "nda_tier": "under-nda"}
{"source_doc": "Asset_Management_Policy.docx", "section": "General", "text": "AST-05 Ensure that the organization's asset tracking system records essential technical information about each information asset (including name, hardware address, and network address).", "nda_tier": "under-nda"}
{"source_doc": "Asset_Management_Policy.docx", "section": "General", "text": "AST-06 Ensure that the organization's asset tracking system records essential business information about each information asset (including business owner, criticality, business unit, and approvals).", "nda_tier": "under-nda"}
{"source_doc": "Asset_Management_Policy.docx", "section": "General", "text": "AST-07 Maintain an automated asset discovery platform to discover information assets (actively or passively) to ensure the organization's asset tracking system is accurate and automatically updated regularly.", "nda_tier": "under-nda"}
{"source_doc": "Asset_Management_Policy.docx", "section": "General", "text": "AST-08 Define a process the organization shall use to approve each information asset in the organization's asset tracking system.", "nda_tier": "under-nda"}
{"source_doc": "Asset_Management_Policy.docx", "section": "General", "text": "AST-09 Define a process the organization shall use to remove unauthorized information assets from the organization's network and decommission unauthorized assets.", "nda_tier": "under-nda"}
{"source_doc": "Asset_Management_Policy.docx", "section": "General", "text": "Policy Sanctions", "nda_tier": "under-nda"}
{"source_doc": "Asset_Management_Policy.docx", "section": "General", "text": "Non-compliance with this policy may result in disciplinary action in line with our corporation's human resources procedures. Consequences may range from mandatory refresher training and written warnings to temporary suspension of remote access privileges and, in severe cases, termination of employment or contractual obligations. Individuals could be subject to legal consequences under applicable laws if violations involve illegal activities. These sanctions emphasize the critical importance of cybersecurity, the individual's role in protecting our digital assets, and the potential risks associated with policy violations. Enforcement will be consistent and impartial, with the severity of the action corresponding directly to the seriousness of the breach.", "nda_tier": "under-nda"}
{"source_doc": "Education_Management_Policy.docx", "section": "General", "text": "Education Management Policy", "nda_tier": "under-nda"}
{"source_doc": "Education_Management_Policy.docx", "section": "General", "text": "Purpose", "nda_tier": "under-nda"}
{"source_doc": "Education_Management_Policy.docx", "section": "General", "text": "Our Cybersecurity Education Policy aims to establish a comprehensive framework for promoting a culture of cybersecurity awareness, knowledge, and responsible behavior throughout our organization. This policy aims to provide guidelines and procedures for developing, implementing, and continuously improving cybersecurity education and awareness programs that empower our employees to recognize, prevent, and respond to potential cyber threats. By prioritizing education and awareness, this policy seeks to enhance the overall security posture of our organization, reduce the likelihood of human error leading to security incidents, and foster a sense of shared responsibility for protecting our systems, data, and networks. Through regular training, communication, and engagement initiatives, we strive to cultivate a vigilant and resilient workforce equipped to safeguard our sensitive information and", "nda_tier": "under-nda"}
{"source_doc": "Education_Management_Policy.docx", "section": "General", "text": "assets in the face of evolving cybersecurity risks.", "nda_tier": "under-nda"}
{"source_doc": "Education_Management_Policy.docx", "section": "General", "text": "Scope", "nda_tier": "under-nda"}
{"source_doc": "Education_Management_Policy.docx", "section": "General", "text": "The Cybersecurity Education Policy applies to all our organization's employees, contractors, vendors, and stakeholders. This policy encompasses planning, developing, implementing, and evaluating cybersecurity education and awareness programs to foster a culture of security awareness and responsible behavior. It covers training sessions, workshops, communication campaigns, and resources to enhance understanding of cybersecurity risks, best practices, policies, and procedures. The policy applies to all individuals who access the organization's network, systems, and sensitive information. Compliance with this policy is mandatory for all personnel, and active participation in cybersecurity education and awareness initiatives is required. Any exceptions or deviations from this policy require approval from the designated authority responsible for cybersecurity governance.", "nda_tier": "under-nda"}
{"source_doc": "Education_Management_Policy.docx", "section": "General", "text": "Safeguards", "nda_tier": "under-nda"}
{"source_doc": "Education_Management_Policy.docx", "section": "General", "text": "To achieve the organization's overall mission, and the purpose of this cybersecurity policy, the organization shall:", "nda_tier": "under-nda"}
{"source_doc": "Education_Management_Policy.docx", "section": "General", "text": "EDU-01 Ensure that all workforce members have access to the documentation defining the cybersecurity safeguards related to their roles and responsibilities.", "nda_tier": "under-nda"}
{"source_doc": "Education_Management_Policy.docx", "section": "General", "text": "EDU-02 Maintain a technology platform for delivering cybersecurity-related education to workforce members (such as a Learning Management System (LMS)).", "nda_tier": "under-nda"}
{"source_doc": "Education_Management_Policy.docx", "section": "General", "text": "EDU-03 Maintain a technology platform (such as a Learning Management System (LMS)) for tracking cybersecurity-related education delivered to workforce members.", "nda_tier": "under-nda"}
{"source_doc": "Education_Management_Policy.docx", "section": "General", "text": "EDU-04 Ensure that all workforce members (including engineers, developers, and privileged users) regularly receive appropriate education on cybersecurity safeguards related to their roles and responsibilities.", "nda_tier": "under-nda"}
{"source_doc": "Education_Management_Policy.docx", "section": "General", "text": "EDU-05 Ensure that all workforce members regularly receive appropriate cybersecurity awareness training that is appropriate to their roles and responsibilities.", "nda_tier": "under-nda"}
{"source_doc": "Education_Management_Policy.docx", "section": "General", "text": "EDU-06 Ensure that the organization's cybersecurity education program appropriately educates workforce members on securely authenticating to information systems.", "nda_tier": "under-nda"}
{"source_doc": "Education_Management_Policy.docx", "section": "General", "text": "EDU-07 Ensure the organization's cybersecurity education program appropriately educates workforce members on securely communicating over untrusted networks.", "nda_tier": "under-nda"}
{"source_doc": "Education_Management_Policy.docx", "section": "General", "text": "EDU-08 Ensure that the organization's cybersecurity education program appropriately educates workforce members on securely handling data, including the most likely reasons data may be exposed.", "nda_tier": "under-nda"}
{"source_doc": "Education_Management_Policy.docx", "section": "General", "text": "EDU-09 Ensure the organization's cybersecurity education program appropriately educates workforce members on securely responding to social engineering techniques, including identifying and handling such activities.", "nda_tier": "under-nda"}
{"source_doc": "Education_Management_Policy.docx", "section": "General", "text": "EDU-10 Ensure the organization's cybersecurity education program appropriately educates workforce members on securely reporting cybersecurity safeguard failures.", "nda_tier": "under-nda"}
{"source_doc": "Education_Management_Policy.docx", "section": "General", "text": "EDU-11 Ensure that the organization's cybersecurity education program appropriately educates workforce members on securely reporting potential cybersecurity incidents to the organization.", "nda_tier": "under-nda"}
{"source_doc": "Education_Management_Policy.docx", "section": "General", "text": "EDU-12 Regularly perform educational activities that reinforce the organization's cybersecurity education program and validate the effectiveness of the program.", "nda_tier": "under-nda"}
{"source_doc": "Education_Management_Policy.docx", "section": "General", "text": "EDU-13 Regularly validate the effectiveness of the organization's cybersecurity education program using quantifiable measures that can be reported to business stakeholders.", "nda_tier": "under-nda"}
{"source_doc": "Education_Management_Policy.docx", "section": "General", "text": "EDU-14 Regularly report the results of the validation of the effectiveness of the organization's cybersecurity education program to business stakeholders.", "nda_tier": "under-nda"}
{"source_doc": "Education_Management_Policy.docx", "section": "General", "text": "Policy Sanctions", "nda_tier": "under-nda"}
{"source_doc": "Education_Management_Policy.docx", "section": "General", "text": "Non-compliance with this policy may result in disciplinary action in line with our corporation's human resources procedures. Consequences may range from mandatory refresher training and written warnings to temporary suspension of remote access privileges and, in severe cases, termination of employment or contractual obligations. Individuals could be subject to legal consequences under applicable laws if violations involve illegal activities. These sanctions emphasize the critical importance of cybersecurity, the individual's role in protecting our digital assets, and the potential risks associated with policy violations. Enforcement will be consistent and impartial, with the severity of the action corresponding directly to the seriousness of the breach.", "nda_tier": "under-nda"}
{"source_doc": "Information Security Policy.docx", "section": "General", "text": "Information Security Policy", "nda_tier": "under-nda"}
{"source_doc": "Information Security Policy.docx", "section": "1. Purpose", "text": "The purpose of this policy is to define the organization’s approach to protecting its information assets from threats that could compromise confidentiality, integrity, or availability. It establishes governance principles, defines responsibilities, and sets the tone for a culture of security across the organization.", "nda_tier": "under-nda"}
{"source_doc": "Information Security Policy.docx", "section": "2. Scope", "text": "This policy applies to:", "nda_tier": "under-nda"}
{"source_doc": "Information Security Policy.docx", "section": "2. Scope", "text": "All employees, contractors, interns, consultants, and third parties with access to company systems or data.", "nda_tier": "under-nda"}
{"source_doc": "Information Security Policy.docx", "section": "2. Scope", "text": "All forms of information (digital, printed, verbal, or otherwise).", "nda_tier": "under-nda"}
{"source_doc": "Information Security Policy.docx", "section": "2. Scope", "text": "All devices and systems that store, process, or transmit company data, whether owned by the organization or used under bring-your-own-device (BYOD) arrangements.", "nda_tier": "under-nda"}
{"source_doc": "Information Security Policy.docx", "section": "2. Scope", "text": "All business units, subsidiaries, and affiliates of the organization.", "nda_tier": "under-nda"}
{"source_doc": "Information Security Policy.docx", "section": "3. Policy Objectives", "text": "The organization’s information security program is designed to:", "nda_tier": "under-nda"}
{"source_doc": "Information Security Policy.docx", "section": "3. Policy Objectives", "text": "Protect sensitive and business-critical data from unauthorized access, alteration, disclosure, or destruction.", "nda_tier": "under-nda"}
{"source_doc": "Information Security Policy.docx", "section": "3. Policy Objectives", "text": "Ensure continuity of business operations in the face of disruptive events.", "nda_tier": "under-nda"}
{"source_doc": "Information Security Policy.docx", "section": "3. Policy Objectives", "text": "Demonstrate compliance with applicable legal, regulatory, and contractual obligations.", "nda_tier": "under-nda"}
{"source_doc": "Information Security Policy.docx", "section": "3. Policy Objectives", "text": "Embed secure practices into daily business activities, technology design, and vendor relationships.", "nda_tier": "under-nda"}
{"source_doc": "Information Security Policy.docx", "section": "3. Policy Objectives", "text": "Promote awareness and accountability so that every individual understands their role in protecting information.", "nda_tier": "under-nda"}
{"source_doc": "Information Security Policy.docx", "section": "4. Security Principles", "text": "The organization will adhere to the following core principles:", "nda_tier": "under-nda"}
{"source_doc": "Information Security Policy.docx", "section": "4. Security Principles", "text": "Confidentiality – Access to information is restricted to authorized individuals on a need-to-know basis.", "nda_tier": "under-nda"}
{"source_doc": "Information Security Policy.docx", "section": "4. Security Principles", "text": "Integrity – Data is accurate, complete, and protected from unauthorized modification.", "nda_tier": "under-nda"}
{"source_doc": "Information Security Policy.docx", "section": "4. Security Principles", "text": "Availability – Information and systems are accessible when needed to support business functions.", "nda_tier": "under-nda"}
{"source_doc": "Information Security Policy.docx", "section": "4. Security Principles", "text": "Accountability – Users and administrators are responsible for their actions and access.", "nda_tier": "under-nda"}
{"source_doc": "Information Security Policy.docx", "section": "4. Security Principles", "text": "Resilience – Security controls are designed to anticipate, withstand, recover, and adapt to adverse conditions.", "nda_tier": "under-nda"}
{"source_doc": "Information Security Policy.docx", "section": "5.1 Governance & Risk Management", "text": "A formal information security governance structure, led by the Chief Information Security Officer (CISO), will oversee the program.", "nda_tier": "under-nda"}
{"source_doc": "Information Security Policy.docx", "section": "5.1 Governance & Risk Management", "text": "Risk assessments must be conducted regularly to identify and evaluate threats, vulnerabilities, and impacts.", "nda_tier": "under-nda"}
{"source_doc": "Information Security Policy.docx", "section": "5.1 Governance & Risk Management", "text": "Risk treatment decisions must align with the organization’s risk appetite and be approved by leadership.", "nda_tier": "under-nda"}
{"source_doc": "Information Security Policy.docx", "section": "5.1 Governance & Risk Management", "text": "All security policies must be reviewed annually and updated as needed.", "nda_tier": "under-nda"}
{"source_doc": "Information Security Policy.docx", "section": "5.2 Access & Identity Management", "text": "Access to systems must follow the principle of least privilege.", "nda_tier": "under-nda"}
{"source_doc": "Information Security Policy.docx", "section": "5.2 Access & Identity Management", "text": "Multi-factor authentication (MFA) must be enforced for administrative accounts, remote access, and systems handling sensitive data.", "nda_tier": "under-nda"}
{"source_doc": "Information Security Policy.docx", "section": "5.2 Access & Identity Management", "text": "Privileged account use must be controlled, logged, and reviewed regularly.", "nda_tier": "under-nda"}
{"source_doc": "Information Security Policy.docx", "section": "5.2 Access & Identity Management", "text": "User accounts must be provisioned and deprovisioned promptly through established processes.", "nda_tier": "under-nda"}
{"source_doc": "Information Security Policy.docx", "section": "5.3 Data Protection", "text": "Information must be classified based on sensitivity (e.g., Public, Internal, Confidential, Restricted).", "nda_tier": "under-nda"}
{"source_doc": "Information Security Policy.docx", "section": "5.3 Data Protection", "text": "Data classified as Confidential or Restricted must be encrypted at rest and in transit using approved algorithms.", "nda_tier": "under-nda"}
{"source_doc": "Information Security Policy.docx", "section": "5.3 Data Protection", "text": "Portable media must be encrypted or otherwise secured before transport.", "nda_tier": "under-nda"}
{"source_doc": "Information Security Policy.docx", "section": "5.3 Data Protection", "text": "Sensitive information must not be stored or transmitted using unauthorized services (e.g., personal email, consumer cloud storage).", "nda_tier": "under-nda"}
{"source_doc": "Information Security Policy.docx", "section": "5.4 Secure Systems & Development", "text": "Security must be embedded in the software development lifecycle (SDLC), including threat modeling, secure coding practices, and code review.", "nda_tier": "under-nda"}
{"source_doc": "Information Security Policy.docx", "section": "5.4 Secure Systems & Development", "text": "All systems must be configured according to approved baselines and hardened to reduce attack surfaces.", "nda_tier": "under-nda"}
{"source_doc": "Information Security Policy.docx", "section": "5.4 Secure Systems & Development", "text": "Vulnerabilities must be remediated within defined timelines based on severity.", "nda_tier": "under-nda"}
{"source_doc": "Information Security Policy.docx", "section": "5.4 Secure Systems & Development", "text": "Logging, monitoring, and alerting must be enabled on critical systems to detect suspicious activity.", "nda_tier": "under-nda"}
{"source_doc": "Information Security Policy.docx", "section": "5.5 Network & Infrastructure Security", "text": "Network perimeters must be protected by firewalls, intrusion detection/prevention systems, and segmentation.", "nda_tier": "under-nda"}
{"source_doc": "Information Security Policy.docx", "section": "5.5 Network & Infrastructure Security", "text": "Remote access must use secure VPN or equivalent methods with encryption.", "nda_tier": "under-nda"}
{"source_doc": "Information Security Policy.docx", "section": "5.5 Network & Infrastructure Security", "text": "Wireless networks must use strong authentication and encryption (e.g., WPA3 or enterprise-level WPA2).", "nda_tier": "under-nda"}
{"source_doc": "Information Security Policy.docx", "section": "5.5 Network & Infrastructure Security", "text": "Administrative access to infrastructure must occur only through secure, monitored channels.", "nda_tier": "under-nda"}
{"source_doc": "Information Security Policy.docx", "section": "5.6 Third-Party & Cloud Security", "text": "Vendors, partners, and service providers must undergo security due diligence before engagement.", "nda_tier": "under-nda"}
{"source_doc": "Information Security Policy.docx", "section": "5.6 Third-Party & Cloud Security", "text": "Contracts must include information security and privacy requirements.", "nda_tier": "under-nda"}
{"source_doc": "Information Security Policy.docx", "section": "5.6 Third-Party & Cloud Security", "text": "Cloud services must be approved and configured according to security standards, including identity integration and monitoring.", "nda_tier": "under-nda"}
{"source_doc": "Information Security Policy.docx", "section": "5.7 Privacy & Compliance", "text": "Personal data must be processed in accordance with applicable data protection laws and the organization’s Privacy Policy.", "nda_tier": "under-nda"}
{"source_doc": "Information Security Policy.docx", "section": "5.7 Privacy & Compliance", "text": "Any suspected data breach must be reported immediately to the Information Security team.", "nda_tier": "under-nda"}
{"source_doc": "Information Security Policy.docx", "section": "5.7 Privacy & Compliance", "text": "Privacy impact assessments must be conducted for systems or projects handling personal or sensitive information.", "nda_tier": "under-nda"}
{"source_doc": "Information Security Policy.docx", "section": "5.8 Asset & Equipment Management", "text": "All hardware, software, and data assets must be inventoried and tracked throughout their lifecycle.", "nda_tier": "under-nda"}
{"source_doc": "Information Security Policy.docx", "section": "5.8 Asset & Equipment Management", "text": "Disposal of equipment or media must follow secure destruction methods.", "nda_tier": "under-nda"}
{"source_doc": "Information Security Policy.docx", "section": "5.8 Asset & Equipment Management", "text": "Unauthorized hardware and software are prohibited from connecting to corporate networks.", "nda_tier": "under-nda"}
{"source_doc": "Information Security Policy.docx", "section": "5.9 Security Awareness & Training", "text": "All employees must complete security awareness training upon hire and at least annually thereafter.", "nda_tier": "under-nda"}
{"source_doc": "Information Security Policy.docx", "section": "5.9 Security Awareness & Training", "text": "Role-specific training must be provided for staff with elevated responsibilities (e.g., developers, system administrators).", "nda_tier": "under-nda"}
{"source_doc": "Information Security Policy.docx", "section": "5.9 Security Awareness & Training", "text": "Phishing simulations and awareness campaigns will be conducted to strengthen employee vigilance.", "nda_tier": "under-nda"}
{"source_doc": "Information Security Policy.docx", "section": "5.10 Incident Response & Business Continuity", "text": "A formal incident response plan must be maintained and tested at least annually.", "nda_tier": "under-nda"}
{"source_doc": "Information Security Policy.docx", "section": "5.10 Incident Response & Business Continuity", "text": "All employees are required to report suspected or actual security incidents immediately.", "nda_tier": "under-nda"}
{"source_doc": "Information Security Policy.docx", "section": "5.10 Incident Response & Business Continuity", "text": "Business continuity and disaster recovery plans must ensure critical operations can resume within defined recovery objectives.", "nda_tier": "under-nda"}
{"source_doc": "Information Security Policy.docx", "section": "6. Roles & Responsibilities", "text": "Board & Executive Leadership – Approve security strategy and ensure adequate resources are allocated.", "nda_tier": "under-nda"}
{"source_doc": "Information Security Policy.docx", "section": "6. Roles & Responsibilities", "text": "CISO – Owns and maintains the information security program, policies, and risk reporting.", "nda_tier": "under-nda"}
{"source_doc": "Information Security Policy.docx", "section": "6. Roles & Responsibilities", "text": "IT & Security Teams – Implement controls, monitor compliance, and respond to incidents.", "nda_tier": "under-nda"}
{"source_doc": "Information Security Policy.docx", "section": "6. Roles & Responsibilities", "text": "Managers – Ensure teams comply with policies and report incidents promptly.", "nda_tier": "under-nda"}
{"source_doc": "Information Security Policy.docx", "section": "6. Roles & Responsibilities", "text": "All Staff & Contractors – Protect organizational assets, complete training, and comply with security requirements.", "nda_tier": "under-nda"}
{"source_doc": "Information Security Policy.docx", "section": "7. Enforcement", "text": "Failure to comply with this policy may result in disciplinary action, up to and including termination of employment or contract, and may also involve legal or regulatory consequences.", "nda_tier": "under-nda"}
{"source_doc": "Information Security Policy.docx", "section": "8. Review Cycle", "text": "This policy will be reviewed annually by the CISO, with approval from executive leadership. Revisions will be made sooner if required by changes in law, business operations, or the threat landscape.", "nda_tier": "under-nda"}
{"source_doc": "Perimeter_Network_Access_Management_Policy.docx", "section": "General", "text": "Perimeter Network Access Management Policy", "nda_tier": "under-nda"}
{"source_doc": "Perimeter_Network_Access_Management_Policy.docx", "section": "General", "text": "Purpose", "nda_tier": "under-nda"}
{"source_doc": "Perimeter_Network_Access_Management_Policy.docx", "section": "General", "text": "Our Perimeter Network Access Policy aims to establish a comprehensive framework for effectively filtering and monitoring network traffic entering and exiting our organization's network boundaries. This policy aims to provide clear guidelines and procedures for implementing boundary filtering technologies, such as firewalls, intrusion prevention systems, and secure web gateways, to enforce network security controls, protect against unauthorized access, and mitigate the risk of external threats. By implementing robust boundary filtering practices, this policy seeks to minimize the risk of malicious activities, such as unauthorized access attempts, malware infections, and data exfiltration. By configuring appropriate filtering rules, continuous monitoring, and regular updates, we strive to ensure our network resources' confidentiality, integrity, and availability, safeguard sensitive information, and maintain compliance with industry", "nda_tier": "under-nda"}
{"source_doc": "Perimeter_Network_Access_Management_Policy.docx", "section": "General", "text": "standards and regulatory requirements. By prioritizing boundary filtering, we strengthen our overall cybersecurity posture, enhance network resilience, and maintain the trust and confidence of our stakeholders.", "nda_tier": "under-nda"}
{"source_doc": "Perimeter_Network_Access_Management_Policy.docx", "section": "General", "text": "Scope", "nda_tier": "under-nda"}
{"source_doc": "Perimeter_Network_Access_Management_Policy.docx", "section": "General", "text": "The Perimeter Network Access Policy applies to all our organization's employees, contractors, and stakeholders. It encompasses implementing and managing boundary filtering mechanisms to protect our network from unauthorized access and malicious activities. This policy covers all network boundaries, including external connections such as internet access points, virtual private networks (VPNs), and remote access services. It sets forth guidelines for configuring and maintaining boundary filtering technologies, such as firewalls, intrusion prevention systems (IPS), and network access control (NAC) solutions. The policy defines procedures for monitoring and filtering network traffic at the boundaries to enforce security policies, prevent unauthorized access, and detect and block malicious activities. Compliance with this policy is mandatory for all individuals within the organization, and any deviations or", "nda_tier": "under-nda"}
{"source_doc": "Perimeter_Network_Access_Management_Policy.docx", "section": "General", "text": "exceptions require approval from the designated authority responsible for boundary filtering and cybersecurity governance.", "nda_tier": "under-nda"}
{"source_doc": "Perimeter_Network_Access_Management_Policy.docx", "section": "General", "text": "Safeguards", "nda_tier": "under-nda"}
{"source_doc": "Perimeter_Network_Access_Management_Policy.docx", "section": "General", "text": "To achieve the organization's overall mission, and the purpose of this cybersecurity policy, the organization shall:", "nda_tier": "under-nda"}
{"source_doc": "Perimeter_Network_Access_Management_Policy.docx", "section": "General", "text": "PNA-01 Maintain an inventory of the organization's approved perimeter network connections (including Internet and third-party connections).", "nda_tier": "under-nda"}
{"source_doc": "Perimeter_Network_Access_Management_Policy.docx", "section": "General", "text": "PNA-02 Maintain documented Access Control Lists (ACLs) for the organization's approved perimeter network connections.", "nda_tier": "under-nda"}
{"source_doc": "Perimeter_Network_Access_Management_Policy.docx", "section": "General", "text": "PNA-03 Maintain perimeter network firewalls at the organization's approved perimeter network connections.", "nda_tier": "under-nda"}
{"source_doc": "Perimeter_Network_Access_Management_Policy.docx", "section": "General", "text": "PNA-04 Ensure the organization's approved perimeter network firewalls perform IP-based filtering of perimeter network connections.", "nda_tier": "under-nda"}
{"source_doc": "Perimeter_Network_Access_Management_Policy.docx", "section": "General", "text": "PNA-05 Ensure the organization's approved perimeter network firewalls perform protocol-based (TCP, UDP, or similar) inbound filtering of perimeter network connections.", "nda_tier": "under-nda"}
{"source_doc": "Perimeter_Network_Access_Management_Policy.docx", "section": "General", "text": "PNA-06 Ensure the organization's approved perimeter network firewalls perform protocol-based (TCP, UDP, or similar) outbound filtering of perimeter network connections.", "nda_tier": "under-nda"}
{"source_doc": "Perimeter_Network_Access_Management_Policy.docx", "section": "General", "text": "PNA-07 Ensure the organization's approved perimeter network firewalls perform application-based filtering of perimeter network connections.", "nda_tier": "under-nda"}
{"source_doc": "Perimeter_Network_Access_Management_Policy.docx", "section": "General", "text": "PNA-08 Ensure that the organization's approved perimeter network firewalls perform user-based filtering of network connections, ensuring that only authorized users can remotely connect to an organization's network.", "nda_tier": "under-nda"}
{"source_doc": "Perimeter_Network_Access_Management_Policy.docx", "section": "General", "text": "PNA-09 Ensure the organization's approved perimeter network firewalls require Multi-Factor Authentication (MFA) when authenticating all remote connections.", "nda_tier": "under-nda"}
{"source_doc": "Perimeter_Network_Access_Management_Policy.docx", "section": "General", "text": "PNA-10 Ensure the organization's approved perimeter network firewalls use encrypted channels (such as TLS) when authenticating all remote connections.", "nda_tier": "under-nda"}
{"source_doc": "Perimeter_Network_Access_Management_Policy.docx", "section": "General", "text": "PNA-11 Ensure the organization's approved perimeter network firewalls require User Behavior Analytics (UBA) when authenticating all remote connections.", "nda_tier": "under-nda"}
{"source_doc": "Perimeter_Network_Access_Management_Policy.docx", "section": "General", "text": "PNA-12 Maintain a system to perform full packet capture for all of the organization's perimeter network traffic.", "nda_tier": "under-nda"}
{"source_doc": "Perimeter_Network_Access_Management_Policy.docx", "section": "General", "text": "PNA-13 Maintain perimeter network Intrusion Detection Systems (IDS) and Intrusion Prevention Systems (IPS) at the organization's approved perimeter network connections.", "nda_tier": "under-nda"}
{"source_doc": "Perimeter_Network_Access_Management_Policy.docx", "section": "General", "text": "PNA-14 Maintain a perimeter web-based URL filtering system at the organization's Internet connections.", "nda_tier": "under-nda"}
{"source_doc": "Perimeter_Network_Access_Management_Policy.docx", "section": "General", "text": "PNA-15 Ensure the organization's web-based URL filtering systems block network connections to unapproved web-based services (such as email, storage, or similar).", "nda_tier": "under-nda"}
{"source_doc": "Perimeter_Network_Access_Management_Policy.docx", "section": "General", "text": "PNA-16 Ensure the organization's web-based URL filtering systems decrypt all TLS-encrypted traffic to facilitate web-based URL filtering.", "nda_tier": "under-nda"}
{"source_doc": "Perimeter_Network_Access_Management_Policy.docx", "section": "General", "text": "PNA-17 Ensure that the organization's web-based URL filtering systems utilize Data Loss Prevention (DLP) on each of its Internet connections.", "nda_tier": "under-nda"}
{"source_doc": "Perimeter_Network_Access_Management_Policy.docx", "section": "General", "text": "PNA-18 Ensure that the organization's perimeter network firewalls log appropriate events observed by the system.", "nda_tier": "under-nda"}
{"source_doc": "Perimeter_Network_Access_Management_Policy.docx", "section": "General", "text": "PNA-19 Ensure that the organization's web-based URL filtering systems log all URLs observed by the system.", "nda_tier": "under-nda"}
{"source_doc": "Perimeter_Network_Access_Management_Policy.docx", "section": "General", "text": "PNA-20 Ensure that the organization's Domain Name System (DNS) systems log all DNS queries observed by the system.", "nda_tier": "under-nda"}
{"source_doc": "Perimeter_Network_Access_Management_Policy.docx", "section": "General", "text": "PNA-21 Ensure that the organization's Intrusion Detection Systems (IDS) or Intrusion Prevention Systems (IPS) systems log all appropriate events observed by the system.", "nda_tier": "under-nda"}
{"source_doc": "Perimeter_Network_Access_Management_Policy.docx", "section": "General", "text": "PNA-22 Ensure that the organization's perimeter network firewalls log all remote user connections observed by the system.", "nda_tier": "under-nda"}
{"source_doc": "Perimeter_Network_Access_Management_Policy.docx", "section": "General", "text": "PNA-23 Maintain network deception technologies at the organization's perimeter network connections to facilitate incident detection and management.", "nda_tier": "under-nda"}
{"source_doc": "Perimeter_Network_Access_Management_Policy.docx", "section": "General", "text": "Policy Sanctions", "nda_tier": "under-nda"}
{"source_doc": "Perimeter_Network_Access_Management_Policy.docx", "section": "General", "text": "Non-compliance with this policy may result in disciplinary action in line with our corporation's human resources procedures. Consequences may range from mandatory refresher training and written warnings to temporary suspension of remote access privileges and, in severe cases, termination of employment or contractual obligations. Individuals could be subject to legal consequences under applicable laws if violations involve illegal activities. These sanctions emphasize the critical importance of cybersecurity, the individual's role in protecting our digital assets, and the potential risks associated with policy violations. Enforcement will be consistent and impartial, with the severity of the action corresponding directly to the seriousness of the breach.", "nda_tier": "under-nda"}
{"source_doc": "Privacy_Management_Policy.docx", "section": "General", "text": "Privacy Management Policy", "nda_tier": "under-nda"}
{"source_doc": "Privacy_Management_Policy.docx", "section": "General", "text": "Purpose", "nda_tier": "under-nda"}
{"source_doc": "Privacy_Management_Policy.docx", "section": "General", "text": "Our Data Privacy Policy aims to establish a comprehensive framework for protecting the privacy and confidentiality of personal and sensitive data entrusted to our organization. This policy aims to provide clear guidelines and procedures for data collection, storage, use, disclosure, and disposal in compliance with applicable privacy laws, regulations, and industry best practices. By implementing effective data privacy practices, this policy seeks to ensure the lawful and ethical handling of personal information, safeguard the rights and privacy of individuals, and maintain the trust and confidence of our customers, partners, and stakeholders. Through robust data protection measures, privacy impact assessments, and ongoing monitoring, we strive to mitigate the risks of unauthorized access, data breaches, and misuse of personal information while fostering", "nda_tier": "under-nda"}
{"source_doc": "Privacy_Management_Policy.docx", "section": "General", "text": "transparency, accountability, and compliance in our data handling practices.", "nda_tier": "under-nda"}
{"source_doc": "Privacy_Management_Policy.docx", "section": "General", "text": "Scope", "nda_tier": "under-nda"}
{"source_doc": "Privacy_Management_Policy.docx", "section": "General", "text": "The Data Privacy Policy applies to all our organization's employees, contractors, vendors, and stakeholders. It encompasses the protection and responsible handling of personal and sensitive information collected and processed by the organization. This policy covers collecting, storing, accessing, transferring, and disposing of personal data in compliance with applicable data protection laws and regulations. It outlines procedures for obtaining consent, implementing security measures to safeguard data, ensuring data accuracy, and responding to data subject rights requests. The policy sets forth guidelines for data breach notification, data sharing agreements, and vendor management to protect the privacy and confidentiality of individuals' information. Compliance with this policy is mandatory for all individuals within the organization, and any deviations or exceptions require approval from the", "nda_tier": "under-nda"}
{"source_doc": "Privacy_Management_Policy.docx", "section": "General", "text": "designated authority responsible for data privacy and cybersecurity governance.", "nda_tier": "under-nda"}
{"source_doc": "Privacy_Management_Policy.docx", "section": "General", "text": "Safeguards", "nda_tier": "under-nda"}
{"source_doc": "Privacy_Management_Policy.docx", "section": "General", "text": "To achieve the organization's overall mission, and the purpose of this cybersecurity policy, the organization shall:", "nda_tier": "under-nda"}
{"source_doc": "Privacy_Management_Policy.docx", "section": "General", "text": "PRV-01 Maintain a transparent, documented privacy program that documents the organization's safeguards to address data privacy.", "nda_tier": "under-nda"}
{"source_doc": "Privacy_Management_Policy.docx", "section": "General", "text": "PRV-02 Ensure that the organization's documented privacy program defines a process for performing data processing authorizations (authorizing, maintaining, and revoking).", "nda_tier": "under-nda"}
{"source_doc": "Privacy_Management_Policy.docx", "section": "General", "text": "PRV-03 Ensure that the organization's documented privacy program defines a process for reviewing, transferring, disclosing, modifying, or deleting data from the organization's information systems for privacy purposes.", "nda_tier": "under-nda"}
{"source_doc": "Privacy_Management_Policy.docx", "section": "General", "text": "PRV-04 Ensure that the organization's documented privacy program defines a process for recording and maintaining an individual's privacy preferences.", "nda_tier": "under-nda"}
{"source_doc": "Privacy_Management_Policy.docx", "section": "General", "text": "PRV-05 Ensure that the organization's documented privacy program defines a process for recording, maintaining, and reviewing stakeholder goals for data privacy.", "nda_tier": "under-nda"}
{"source_doc": "Privacy_Management_Policy.docx", "section": "General", "text": "PRV-06 Ensure that the organization's documented privacy program defines a process for evaluating the organization's use of data for bias.", "nda_tier": "under-nda"}
{"source_doc": "Privacy_Management_Policy.docx", "section": "General", "text": "PRV-07 Ensure that the organization's documented privacy program defines a process for recording and evaluating data provenance and lineage.", "nda_tier": "under-nda"}
{"source_doc": "Privacy_Management_Policy.docx", "section": "General", "text": "PRV-08 Ensure that the organization's documented privacy program defines a process for limiting the identification or inference of individuals when processing data.", "nda_tier": "under-nda"}
{"source_doc": "Privacy_Management_Policy.docx", "section": "General", "text": "PRV-09 Ensure that the organization's documented privacy program defines a process for replacing attribute values with attribute references in the organization's information systems for privacy purposes.", "nda_tier": "under-nda"}
{"source_doc": "Privacy_Management_Policy.docx", "section": "General", "text": "PRV-10 Ensure that the organization's documented privacy program defines a process for informing customers and external business partners about how their data is being used and the organization's privacy goals.", "nda_tier": "under-nda"}
{"source_doc": "Privacy_Management_Policy.docx", "section": "General", "text": "PRV-11 Ensure that the organization's documented privacy program defines a process to obtain feedback from individuals regarding the organization's use of data and the associated privacy risks.", "nda_tier": "under-nda"}
{"source_doc": "Privacy_Management_Policy.docx", "section": "General", "text": "PRV-12 Ensure that the organization's documented privacy program defines a process to allow individuals to request data corrections to their data.", "nda_tier": "under-nda"}
{"source_doc": "Privacy_Management_Policy.docx", "section": "General", "text": "PRV-13 Ensure that the organization's documented privacy program defines a process to allow individuals to request data deletions of their data (right to be forgotten).", "nda_tier": "under-nda"}
{"source_doc": "Privacy_Management_Policy.docx", "section": "General", "text": "PRV-14 Ensure that the organization's documented privacy program defines a process for sharing only appropriate data with third parties.", "nda_tier": "under-nda"}
{"source_doc": "Privacy_Management_Policy.docx", "section": "General", "text": "PRV-15 Maintain a technology platform to record the organization's efforts related to its data privacy program.", "nda_tier": "under-nda"}
{"source_doc": "Privacy_Management_Policy.docx", "section": "General", "text": "PRV-16 Ensure the organization's privacy record system tracks individuals' stated privacy preferences.", "nda_tier": "under-nda"}
{"source_doc": "Privacy_Management_Policy.docx", "section": "General", "text": "PRV-17 Ensure that the organization's privacy record system tracks data correction and deletion requests and the organization's response.", "nda_tier": "under-nda"}
{"source_doc": "Privacy_Management_Policy.docx", "section": "General", "text": "PRV-18 Ensure the organization's privacy record system tracks data disclosures or sharing personal information with third-parties.", "nda_tier": "under-nda"}
{"source_doc": "Privacy_Management_Policy.docx", "section": "General", "text": "Policy Sanctions", "nda_tier": "under-nda"}
{"source_doc": "Privacy_Management_Policy.docx", "section": "General", "text": "Non-compliance with this policy may result in disciplinary action in line with our corporation's human resources procedures. Consequences may range from mandatory refresher training and written warnings to temporary suspension of remote access privileges and, in severe cases, termination of employment or contractual obligations. Individuals could be subject to legal consequences under applicable laws if violations involve illegal activities. These sanctions emphasize the critical importance of cybersecurity, the individual's role in protecting our digital assets, and the potential risks associated with policy violations. Enforcement will be consistent and impartial, with the severity of the action corresponding directly to the seriousness of the breach.", "nda_tier": "under-nda"}
{"source_doc": "Privileged_Account_Management_Policy.docx", "section": "General", "text": "Privileged Account Management Policy", "nda_tier": "under-nda"}
{"source_doc": "Privileged_Account_Management_Policy.docx", "section": "General", "text": "Purpose", "nda_tier": "under-nda"}
{"source_doc": "Privileged_Account_Management_Policy.docx", "section": "General", "text": "Our Privileged Account Management Policy aims to establish a comprehensive framework for the secure management and control of privileged accounts within our organization. This policy aims to provide clear guidelines and procedures for granting, monitoring, and revoking privileges associated with administrative or privileged accounts. This policy seeks to minimize the risk of unauthorized access, data breaches, and insider threats by implementing effective privileged account management practices. By implementing strong authentication mechanisms, segregation of duties, and regular privileged account reviews, we strive to ensure that privileged access is granted only to authorized individuals, protect the confidentiality and integrity of our systems and data, and maintain compliance with regulatory requirements. By prioritizing privileged account management, we strengthen our overall cybersecurity posture, mitigate", "nda_tier": "under-nda"}
{"source_doc": "Privileged_Account_Management_Policy.docx", "section": "General", "text": "the potential for security incidents, and maintain the trust and confidence of our stakeholders.", "nda_tier": "under-nda"}
{"source_doc": "Privileged_Account_Management_Policy.docx", "section": "General", "text": "Scope", "nda_tier": "under-nda"}
{"source_doc": "Privileged_Account_Management_Policy.docx", "section": "General", "text": "The Privileged Account Management Policy applies to all our organization's employees, contractors, and stakeholders. It encompasses managing and controlling privileged accounts, which have elevated access privileges within our IT infrastructure. This policy covers all accounts with administrative or superuser rights, including system administrators, network administrators, and other privileged roles. It sets guidelines for creating, monitoring, and protecting privileged accounts, including strong authentication mechanisms, secure password management, and regular access reviews. The policy defines privileged account provisioning, deprovisioning, and session monitoring procedures to mitigate the risks associated with privileged access. It also outlines the responsibilities of individuals involved in privileged account management processes, including privileged account administrators, IT managers, and security personnel. Compliance with this policy is mandatory for all individuals", "nda_tier": "under-nda"}
{"source_doc": "Privileged_Account_Management_Policy.docx", "section": "General", "text": "within the organization, and any deviations or exceptions require approval from the designated authority responsible for privileged account management and cybersecurity governance.", "nda_tier": "under-nda"}
{"source_doc": "Privileged_Account_Management_Policy.docx", "section": "General", "text": "Safeguards", "nda_tier": "under-nda"}
{"source_doc": "Privileged_Account_Management_Policy.docx", "section": "General", "text": "To achieve the organization's overall mission, and the purpose of this cybersecurity policy, the organization shall:", "nda_tier": "under-nda"}
{"source_doc": "Privileged_Account_Management_Policy.docx", "section": "General", "text": "PAM-01 Maintain an inventory of all privileged accounts configured on endpoint computing systems.", "nda_tier": "under-nda"}
{"source_doc": "Privileged_Account_Management_Policy.docx", "section": "General", "text": "PAM-02 Maintain an inventory of all privileged accounts configured on server computing systems.", "nda_tier": "under-nda"}
{"source_doc": "Privileged_Account_Management_Policy.docx", "section": "General", "text": "PAM-03 Maintain an inventory of all privileged accounts configured on network devices.", "nda_tier": "under-nda"}
{"source_doc": "Privileged_Account_Management_Policy.docx", "section": "General", "text": "PAM-04 Maintain an inventory of all privileged accounts configured on enterprise business applications.", "nda_tier": "under-nda"}
{"source_doc": "Privileged_Account_Management_Policy.docx", "section": "General", "text": "PAM-05 Ensure all privileged accounts on endpoint computing systems are authorized and dedicated privileged accounts are required.", "nda_tier": "under-nda"}
{"source_doc": "Privileged_Account_Management_Policy.docx", "section": "General", "text": "PAM-06 Ensure that all privileged accounts on server computing systems are authorized and require dedicated privileged accounts.", "nda_tier": "under-nda"}
{"source_doc": "Privileged_Account_Management_Policy.docx", "section": "General", "text": "PAM-07 Ensure all privileged accounts on network devices are authorized and require dedicated privileged accounts.", "nda_tier": "under-nda"}
{"source_doc": "Privileged_Account_Management_Policy.docx", "section": "General", "text": "PAM-08 Ensure that all privileged accounts on enterprise business applications are authorized and require dedicated privileged accounts.", "nda_tier": "under-nda"}
{"source_doc": "Privileged_Account_Management_Policy.docx", "section": "General", "text": "PAM-09 Ensure that all default privileged accounts are not using their default system credentials to authenticate to the system.", "nda_tier": "under-nda"}
{"source_doc": "Privileged_Account_Management_Policy.docx", "section": "General", "text": "PAM-10 Ensure that the organization does not allow shared privileged accounts for workforce members except in documented cases for emergency access or via a Privileged Account Management (PAM) system.", "nda_tier": "under-nda"}
{"source_doc": "Privileged_Account_Management_Policy.docx", "section": "General", "text": "PAM-11 Maintain a Privileged Account Management (PAM) or Password Manager (PM) system for documenting service, shared accounts, or shared secrets between workforce members.", "nda_tier": "under-nda"}
{"source_doc": "Privileged_Account_Management_Policy.docx", "section": "General", "text": "PAM-12 Maintain a Privileged Account Management (PAM) system to automatically rotate the credentials (using unique credentials) for each endpoint or server computing system.", "nda_tier": "under-nda"}
{"source_doc": "Privileged_Account_Management_Policy.docx", "section": "General", "text": "PAM-13 Maintain a Privileged Account Management (PAM) system to automatically rotate the credentials (using unique credentials) for each network device.", "nda_tier": "under-nda"}
{"source_doc": "Privileged_Account_Management_Policy.docx", "section": "General", "text": "PAM-14 Ensure the organization's Identity Providers (IDPs) require Multi-Factor Authentication (MFA) for all privileged accounts.", "nda_tier": "under-nda"}
{"source_doc": "Privileged_Account_Management_Policy.docx", "section": "General", "text": "PAM-15 Ensure the organization's Identity Providers (IDPs) logs and alerts when changes are made to privileged group memberships.", "nda_tier": "under-nda"}
{"source_doc": "Privileged_Account_Management_Policy.docx", "section": "General", "text": "PAM-16 Ensure the organization's Identity Providers (IDPs) log and alert account logon events (successful and failed) for all privileged accounts.", "nda_tier": "under-nda"}
{"source_doc": "Privileged_Account_Management_Policy.docx", "section": "General", "text": "Policy Sanctions", "nda_tier": "under-nda"}
{"source_doc": "Privileged_Account_Management_Policy.docx", "section": "General", "text": "Non-compliance with this policy may result in disciplinary action in line with our corporation's human resources procedures. Consequences may range from mandatory refresher training and written warnings to temporary suspension of remote access privileges and, in severe cases, termination of employment or contractual obligations. Individuals could be subject to legal consequences under applicable laws if violations involve illegal activities. These sanctions emphasize the critical importance of cybersecurity, the individual's role in protecting our digital assets, and the potential risks associated with policy violations. Enforcement will be consistent and impartial, with the severity of the action corresponding directly to the seriousness of the breach.", "nda_tier": "under-nda"}
{"source_doc": "Program_Management_Policy.docx", "section": "General", "text": "Program Management Policy", "nda_tier": "under-nda"}
{"source_doc": "Program_Management_Policy.docx", "section": "General", "text": "Purpose", "nda_tier": "under-nda"}
{"source_doc": "Program_Management_Policy.docx", "section": "General", "text": "Our Cybersecurity Program Management Policy aims to establish a comprehensive framework that ensures the confidentiality, integrity, and availability of our organization's information assets. This policy seeks to protect our systems, data, and networks from unauthorized access, misuse, and potential threats while promoting responsible and secure practices throughout the organization. By implementing robust governance measures, this policy seeks to mitigate risks, enhance the resilience of our infrastructure, foster a culture of security awareness, and align our cybersecurity efforts with industry best practices and regulatory requirements. Through effective governance, we strive to maintain the trust of our stakeholders, safeguard our reputation, and safeguard the sensitive information entrusted to us.", "nda_tier": "under-nda"}
{"source_doc": "Program_Management_Policy.docx", "section": "General", "text": "Scope", "nda_tier": "under-nda"}
{"source_doc": "Program_Management_Policy.docx", "section": "General", "text": "The Cybersecurity Program Management Policy applies to all our organization's employees, contractors, vendors, and stakeholders, irrespective of their roles or responsibilities. This policy encompasses all aspects of cybersecurity governance, including strategic planning, risk management, compliance, incident response, and continual improvement. It establishes a framework to guide the organization in effectively managing and mitigating cybersecurity risks, protecting critical information assets, and ensuring sensitive data's confidentiality, integrity, and availability. The policy outlines the responsibilities and accountabilities of individuals within the organization for maintaining a robust cybersecurity posture, complying with relevant laws and regulations, and adhering to industry best practices. Compliance with this policy is mandatory for all personnel, and any exceptions or deviations must be approved by the designated authority responsible for", "nda_tier": "under-nda"}
{"source_doc": "Program_Management_Policy.docx", "section": "General", "text": "cybersecurity governance.", "nda_tier": "under-nda"}
{"source_doc": "Program_Management_Policy.docx", "section": "General", "text": "Safeguards", "nda_tier": "under-nda"}
{"source_doc": "Program_Management_Policy.docx", "section": "General", "text": "To achieve the organization's overall mission, and the purpose of this cybersecurity policy, the organization shall:", "nda_tier": "under-nda"}
{"source_doc": "Program_Management_Policy.docx", "section": "General", "text": "PRG-01 Maintain a cybersecurity program charter that authorizes the existence of a program and gives authority to the program team to use organizational resources to achieve the program objectives.", "nda_tier": "under-nda"}
{"source_doc": "Program_Management_Policy.docx", "section": "General", "text": "PRG-02 Ensure that the organization's cybersecurity program charter defines its scope and applicability to each of the organization's business units or related entities.", "nda_tier": "under-nda"}
{"source_doc": "Program_Management_Policy.docx", "section": "General", "text": "PRG-03 Ensure that the organization's cybersecurity program charter defines the ultimate goal of the cybersecurity program as the confidentiality, integrity, and availability of the organization's information systems.", "nda_tier": "under-nda"}
{"source_doc": "Program_Management_Policy.docx", "section": "General", "text": "PRG-04 Ensure that the organization's cybersecurity program charter defines all the cybersecurity regulations and standards it shall use to define its goals for specific cybersecurity safeguards.", "nda_tier": "under-nda"}
{"source_doc": "Program_Management_Policy.docx", "section": "General", "text": "PRG-05 Ensure that the organization's cybersecurity program charter or supporting documentation formally defines the organization's approach to cybersecurity governance and risk management.", "nda_tier": "under-nda"}
{"source_doc": "Program_Management_Policy.docx", "section": "General", "text": "PRG-06 Ensure that the organization's cybersecurity program charter defines the executive leadership sponsor for the organization's cybersecurity program.", "nda_tier": "under-nda"}
{"source_doc": "Program_Management_Policy.docx", "section": "General", "text": "PRG-07 Ensure that the organization's cybersecurity program charter establishes the authority of the stakeholder committee responsible for the program.", "nda_tier": "under-nda"}
{"source_doc": "Program_Management_Policy.docx", "section": "General", "text": "PRG-08 Ensure that the organization's cybersecurity program charter or supporting documentation lists the specific stakeholder committee members responsible for the organization's cybersecurity program.", "nda_tier": "under-nda"}
{"source_doc": "Program_Management_Policy.docx", "section": "General", "text": "PRG-09 Ensure that the organization's cybersecurity program charter or supporting documentation lists the specific members of the stakeholder committee responsible for its cybersecurity program and that they are from a diverse set of business units, not simply the technology teams.", "nda_tier": "under-nda"}
{"source_doc": "Program_Management_Policy.docx", "section": "General", "text": "PRG-10 Ensure that the organization's cybersecurity program charter or supporting documentation defines the roles and responsibilities of the stakeholder committee members responsible for the organization's cybersecurity program.", "nda_tier": "under-nda"}
{"source_doc": "Program_Management_Policy.docx", "section": "General", "text": "PRG-11 Ensure that the organization's cybersecurity program charter or supporting documentation defines the logistics details (such as meeting cadence and rules of order) for the stakeholder committee responsible for the organization's cybersecurity program.", "nda_tier": "under-nda"}
{"source_doc": "Program_Management_Policy.docx", "section": "General", "text": "PRG-12 Ensure that the organization's cybersecurity program charter has been formally reviewed and updated by the organization's board of directors or executive leadership team.", "nda_tier": "under-nda"}
{"source_doc": "Program_Management_Policy.docx", "section": "General", "text": "PRG-13 Ensure that the organization's board has formally approved the organization's cybersecurity program charter of directors or executive leadership team.", "nda_tier": "under-nda"}
{"source_doc": "Program_Management_Policy.docx", "section": "General", "text": "Policy Sanctions", "nda_tier": "under-nda"}
{"source_doc": "Program_Management_Policy.docx", "section": "General", "text": "Non-compliance with this policy may result in disciplinary action in line with our corporation's human resources procedures. Consequences may range from mandatory refresher training and written warnings to temporary suspension of remote access privileges and, in severe cases, termination of employment or contractual obligations. Individuals could be subject to legal consequences under applicable laws if violations involve illegal activities. These sanctions emphasize the critical importance of cybersecurity, the individual's role in protecting our digital assets, and the potential risks associated with policy violations. Enforcement will be consistent and impartial, with the severity of the action corresponding directly to the seriousness of the breach.", "nda_tier": "under-nda"}
{"source_doc": "Safeguard_Validation_Management_Policy.docx", "section": "General", "text": "Safeguard Validation Management Policy", "nda_tier": "under-nda"}
{"source_doc": "Safeguard_Validation_Management_Policy.docx", "section": "General", "text": "Purpose", "nda_tier": "under-nda"}
{"source_doc": "Safeguard_Validation_Management_Policy.docx", "section": "General", "text": "Our Cybersecurity Safeguard Validation Policy aims to establish a systematic and comprehensive framework for planning, conducting, and managing cybersecurity audits within our organization. This policy aims to provide clear guidelines and procedures for assessing the effectiveness of our cybersecurity controls, identifying vulnerabilities and weaknesses, and ensuring compliance with industry standards, legal regulations, and internal policies. By implementing effective audit management practices, this policy seeks to enhance our cybersecurity governance, identify areas for improvement, and mitigate potential risks and threats. Through regular audits and independent assessments, we strive to maintain the integrity, confidentiality, and availability of our systems, data, and networks while continuously improving our security posture and demonstrating our commitment to security to stakeholders.", "nda_tier": "under-nda"}
{"source_doc": "Safeguard_Validation_Management_Policy.docx", "section": "General", "text": "Scope", "nda_tier": "under-nda"}
{"source_doc": "Safeguard_Validation_Management_Policy.docx", "section": "General", "text": "The Cybersecurity Safeguard Validation Policy applies to all employees, contractors, and stakeholders involved in conducting and managing cybersecurity audits within our organization. This policy encompasses the planning, execution, and oversight of audits to evaluate cybersecurity controls and processes' effectiveness, compliance, and maturity. It covers internal and external audits, including regulatory compliance audits, vulnerability assessments, penetration tests, and security risk assessments. The policy establishes guidelines for audit planning, scoping, resource allocation, documentation, and reporting. It ensures that audit findings are addressed, remediation plans are developed, and continuous improvement is fostered. Compliance with this policy is mandatory for all individuals involved in Cybersecurity Safeguard Validation, and any deviations or exceptions require approval from the designated authority responsible for cybersecurity governance.", "nda_tier": "under-nda"}
{"source_doc": "Safeguard_Validation_Management_Policy.docx", "section": "General", "text": "Safeguards", "nda_tier": "under-nda"}
{"source_doc": "Safeguard_Validation_Management_Policy.docx", "section": "General", "text": "To achieve the organization's overall mission, and the purpose of this cybersecurity policy, the organization shall:", "nda_tier": "under-nda"}
{"source_doc": "Safeguard_Validation_Management_Policy.docx", "section": "General", "text": "VAL-01 Maintain a cybersecurity safeguard validation (audit) plan that documents the assessments the organization shall perform to validate the quality of the organization's cybersecurity safeguards.", "nda_tier": "under-nda"}
{"source_doc": "Safeguard_Validation_Management_Policy.docx", "section": "General", "text": "VAL-02 Ensure that the organization's cybersecurity safeguard validation (audit) plan is a multi-year plan that regularly addresses all of the scopes the organization should assess.", "nda_tier": "under-nda"}
{"source_doc": "Safeguard_Validation_Management_Policy.docx", "section": "General", "text": "VAL-03 Ensure that the organization's cybersecurity safeguard validation (audit) plan establishes criticality rankings for each of the assessment scopes in its assessment plan.", "nda_tier": "under-nda"}
{"source_doc": "Safeguard_Validation_Management_Policy.docx", "section": "General", "text": "VAL-04 Ensure that the organization's cybersecurity safeguard validation (audit) plan defines who should perform each assessment scope in its assessment plan.", "nda_tier": "under-nda"}
{"source_doc": "Safeguard_Validation_Management_Policy.docx", "section": "General", "text": "VAL-05 Ensure that the organization's cybersecurity safeguard validation (audit) plan includes each of the cybersecurity penetration testing scopes it should assess regularly.", "nda_tier": "under-nda"}
{"source_doc": "Safeguard_Validation_Management_Policy.docx", "section": "General", "text": "VAL-06 Ensure that the organization's cybersecurity safeguard validation (audit) plan includes software application penetration tests in its assessment plan.", "nda_tier": "under-nda"}
{"source_doc": "Safeguard_Validation_Management_Policy.docx", "section": "General", "text": "VAL-07 Ensure that the organization's cybersecurity safeguard validation (audit) plan includes red team cybersecurity assessments in its assessment plan.", "nda_tier": "under-nda"}
{"source_doc": "Safeguard_Validation_Management_Policy.docx", "section": "General", "text": "VAL-08 Ensure that the organization's cybersecurity safeguard validation (audit) plan defines where cybersecurity penetration testing should be performed only against test systems due to the sensitivity of such systems.", "nda_tier": "under-nda"}
{"source_doc": "Safeguard_Validation_Management_Policy.docx", "section": "General", "text": "VAL-09 Ensure that the organization's cybersecurity safeguard validation (audit) plan defines how cybersecurity penetration testing should utilize vulnerability scanners as a part of the assessments.", "nda_tier": "under-nda"}
{"source_doc": "Safeguard_Validation_Management_Policy.docx", "section": "General", "text": "VAL-10 Ensure that the organization's cybersecurity safeguard validation (audit) plan defines when cybersecurity penetration testing should be documented in machine-readable formats (such as SCAP).", "nda_tier": "under-nda"}
{"source_doc": "Safeguard_Validation_Management_Policy.docx", "section": "General", "text": "VAL-11 Ensure that the organization's cybersecurity safeguard validation (audit) plan defines how the organization will monitor user accounts during cybersecurity penetration tests.", "nda_tier": "under-nda"}
{"source_doc": "Safeguard_Validation_Management_Policy.docx", "section": "General", "text": "VAL-12 Ensure that the organization's leadership stakeholders regularly approve the organization's cybersecurity safeguard validation (audit) plan.", "nda_tier": "under-nda"}
{"source_doc": "Safeguard_Validation_Management_Policy.docx", "section": "General", "text": "VAL-13 Ensure that the organization's leadership stakeholders regularly allocate and assign resources to the organization's safeguard validation (audit) plan and complete each assessment according to the schedule defined.", "nda_tier": "under-nda"}
{"source_doc": "Safeguard_Validation_Management_Policy.docx", "section": "General", "text": "VAL-14 Ensure that the organization documents the results of each cybersecurity assessment in a central software platform (such as a Governance, Risk, and Compliance (GRC) tool).", "nda_tier": "under-nda"}
{"source_doc": "Safeguard_Validation_Management_Policy.docx", "section": "General", "text": "VAL-15 Ensure that the organization tracks the progress of each cybersecurity assessment in a central software platform (such as a Governance, Risk, and Compliance (GRC) tool).", "nda_tier": "under-nda"}
{"source_doc": "Safeguard_Validation_Management_Policy.docx", "section": "General", "text": "VAL-16 Ensure that the organization regularly reports the results of each cybersecurity assessment to its leadership stakeholders.", "nda_tier": "under-nda"}
{"source_doc": "Safeguard_Validation_Management_Policy.docx", "section": "General", "text": "Policy Sanctions", "nda_tier": "under-nda"}
{"source_doc": "Safeguard_Validation_Management_Policy.docx", "section": "General", "text": "Non-compliance with this policy may result in disciplinary action in line with our corporation's human resources procedures. Consequences may range from mandatory refresher training and written warnings to temporary suspension of remote access privileges and, in severe cases, termination of employment or contractual obligations. Individuals could be subject to legal consequences under applicable laws if violations involve illegal activities. These sanctions emphasize the critical importance of cybersecurity, the individual's role in protecting our digital assets, and the potential risks associated with policy violations. Enforcement will be consistent and impartial, with the severity of the action corresponding directly to the seriousness of the breach.", "nda_tier": "under-nda"}
{"source_doc": "Software_Development_Management_Policy.docx", "section": "General", "text": "Software Development Management Policy", "nda_tier": "under-nda"}
{"source_doc": "Software_Development_Management_Policy.docx", "section": "General", "text": "Purpose", "nda_tier": "under-nda"}
{"source_doc": "Software_Development_Management_Policy.docx", "section": "General", "text": "Our Software Development Policy aims to define and implement robust, secure, and standardized practices throughout the software lifecycle, including design, development, testing, deployment, and maintenance. This policy aims to mitigate the risks associated with insecure coding practices, inadequate testing, and unauthorized modifications, thereby ensuring the reliability, stability, and security of the software we create and deploy. By establishing clear procedures, this policy upholds our commitment to deliver high-quality, secure software that supports our business objectives, meets regulatory compliance standards, and provides value to our stakeholders while protecting our digital assets' integrity, confidentiality, and availability.", "nda_tier": "under-nda"}
{"source_doc": "Software_Development_Management_Policy.docx", "section": "General", "text": "Scope", "nda_tier": "under-nda"}
{"source_doc": "Software_Development_Management_Policy.docx", "section": "General", "text": "The Software Development Policy applies to all software development activities conducted by employees, contractors, and third-party vendors on behalf of our organization. It encompasses the entire software development lifecycle, including planning, design, coding, testing, deployment, maintenance, and retirement of software applications and systems. This policy applies to all software development projects, regardless of the platform, programming language, or development methodology employed. It establishes guidelines, standards, and best practices to ensure the security, reliability, and integrity of the software developed within our organization. Compliance with this policy is mandatory for all individuals involved in software development, and adherence to industry-specific regulations, software licensing requirements, and intellectual property rights is essential. Deviations or exceptions to this policy must be approved by the", "nda_tier": "under-nda"}
{"source_doc": "Software_Development_Management_Policy.docx", "section": "General", "text": "designated authority responsible for software development governance and security.", "nda_tier": "under-nda"}
{"source_doc": "Software_Development_Management_Policy.docx", "section": "General", "text": "Safeguards", "nda_tier": "under-nda"}
{"source_doc": "Software_Development_Management_Policy.docx", "section": "General", "text": "To achieve the organization's overall mission, and the purpose of this cybersecurity policy, the organization shall:", "nda_tier": "under-nda"}
{"source_doc": "Software_Development_Management_Policy.docx", "section": "General", "text": "SDM-01 Ensure the organization's software development program adheres to the organization's cybersecurity governance safeguards.", "nda_tier": "under-nda"}
{"source_doc": "Software_Development_Management_Policy.docx", "section": "General", "text": "SDM-02 Ensure that each of the organization's software application development teams is governed by the organization's approved cybersecurity governance program.", "nda_tier": "under-nda"}
{"source_doc": "Software_Development_Management_Policy.docx", "section": "General", "text": "SDM-03 Maintain a documented Software Development Lifecycle (SDLC) to govern the organization's development and maintenance of software applications.", "nda_tier": "under-nda"}
{"source_doc": "Software_Development_Management_Policy.docx", "section": "General", "text": "SDM-04 Ensure that each of the organization's software application development teams follows the organization's approved Software Development Lifecycle (SDLC).", "nda_tier": "under-nda"}
{"source_doc": "Software_Development_Management_Policy.docx", "section": "General", "text": "SDM-05 Maintain an approved inventory of each software development coding language used by the organization's software application development teams (by team).", "nda_tier": "under-nda"}
{"source_doc": "Software_Development_Management_Policy.docx", "section": "General", "text": "SDM-06 Maintain a documented set of coding standards for each software development coding language used by the organization's software application development teams.", "nda_tier": "under-nda"}
{"source_doc": "Software_Development_Management_Policy.docx", "section": "General", "text": "SDM-07 Ensure that each organization's software development coding standards define how software application developers perform input validation in their software applications.", "nda_tier": "under-nda"}
{"source_doc": "Software_Development_Management_Policy.docx", "section": "General", "text": "SDM-08 Ensure that each organization's software development coding standards define how software application developers will only utilize organization and industry-approved encryption algorithms in their software applications.", "nda_tier": "under-nda"}
{"source_doc": "Software_Development_Management_Policy.docx", "section": "General", "text": "SDM-09 Ensure that each organization's software development coding standard defines how software application developers will only utilize organization‚ and industry-approved data exchange protocols in their software applications.", "nda_tier": "under-nda"}
{"source_doc": "Software_Development_Management_Policy.docx", "section": "General", "text": "SDM-10 Ensure that each of the organization's software development coding standards specifically defines how software application developers will perform error handling in their software applications.", "nda_tier": "under-nda"}
{"source_doc": "Software_Development_Management_Policy.docx", "section": "General", "text": "SDM-11 Ensure that each of the organization's software development coding standards defines how software application developers will include data privacy values in their software applications.", "nda_tier": "under-nda"}
{"source_doc": "Software_Development_Management_Policy.docx", "section": "General", "text": "SDM-12 Maintain technical safeguards to create separation between the organization's development and production application systems.", "nda_tier": "under-nda"}
{"source_doc": "Software_Development_Management_Policy.docx", "section": "General", "text": "SDM-13 Ensure that the organization's non-production application systems do not contain any sensitive or personally identifiable information.", "nda_tier": "under-nda"}
{"source_doc": "Software_Development_Management_Policy.docx", "section": "General", "text": "SDM-14 Ensure that the organization's software application development teams do not have privileged access to the organization's production application systems.", "nda_tier": "under-nda"}
{"source_doc": "Software_Development_Management_Policy.docx", "section": "General", "text": "Policy Sanctions", "nda_tier": "under-nda"}
{"source_doc": "Software_Development_Management_Policy.docx", "section": "General", "text": "Non-compliance with this policy may result in disciplinary action in line with our corporation's human resources procedures. Consequences may range from mandatory refresher training and written warnings to temporary suspension of remote access privileges and, in severe cases, termination of employment or contractual obligations. Individuals could be subject to legal consequences under applicable laws if violations involve illegal activities. These sanctions emphasize the critical importance of cybersecurity, the individual's role in protecting our digital assets, and the potential risks associated with policy violations. Enforcement will be consistent and impartial, with the severity of the action corresponding directly to the seriousness of the breach.", "nda_tier": "under-nda"}
{"source_doc": "Software_Management_Policy.docx", "section": "General", "text": "Software Management Policy", "nda_tier": "under-nda"}
{"source_doc": "Software_Management_Policy.docx", "section": "General", "text": "Purpose", "nda_tier": "under-nda"}
{"source_doc": "Software_Management_Policy.docx", "section": "General", "text": "Our Software Management Policy aims to establish a comprehensive framework for identifying, tracking, and managing software assets within our organization, ensuring their security, compliance, and effective lifecycle management. This policy provides clear guidelines and procedures for discovering, cataloging, and maintaining an accurate inventory of software applications and systems across our network. By implementing effective software inventory and discovery practices, this policy seeks to enhance visibility into our software landscape, improve license compliance, identify and remediate vulnerabilities, and reduce the risk of unauthorized or unsupported software deployments. Through regular software audits, vulnerability assessments, and patch management, we strive to mitigate the potential security risks associated with unapproved or outdated software, protect against software-related vulnerabilities, and maintain the integrity, confidentiality, and availability", "nda_tier": "under-nda"}
{"source_doc": "Software_Management_Policy.docx", "section": "General", "text": "of our systems and data. By prioritizing software inventory and discovery, we enable effective software asset management, strengthen our overall cybersecurity posture, and ensure regulatory compliance.", "nda_tier": "under-nda"}
{"source_doc": "Software_Management_Policy.docx", "section": "General", "text": "Scope", "nda_tier": "under-nda"}
{"source_doc": "Software_Management_Policy.docx", "section": "General", "text": "The Software Management Policy applies to all our organization's employees, contractors, and stakeholders. It encompasses systematically identifying, tracking, and managing all software applications and licenses utilized within our infrastructure. This policy covers commercial and in-house-developed software, including operating systems, productivity tools, and specialized applications. It establishes procedures for conducting regular software inventories, maintaining accurate records of software installations and versions, and tracking software licenses to ensure compliance. The policy sets forth guidelines for software discovery and monitoring techniques to identify unauthorized or unmanaged software within the organization's network. Compliance with this policy is mandatory for all individuals within the organization, and any deviations or exceptions require approval from the designated authority responsible for software inventory and cybersecurity governance.", "nda_tier": "under-nda"}
{"source_doc": "Software_Management_Policy.docx", "section": "General", "text": "Safeguards", "nda_tier": "under-nda"}
{"source_doc": "Software_Management_Policy.docx", "section": "General", "text": "To achieve the organization's overall mission, and the purpose of this cybersecurity policy, the organization shall:", "nda_tier": "under-nda"}
{"source_doc": "Software_Management_Policy.docx", "section": "General", "text": "SW-01 Maintain a system to maintain an inventory of the organization's approved software.", "nda_tier": "under-nda"}
{"source_doc": "Software_Management_Policy.docx", "section": "General", "text": "SW-02 Ensure the organization's software inventory system records appropriate demographics for each software application.", "nda_tier": "under-nda"}
{"source_doc": "Software_Management_Policy.docx", "section": "General", "text": "SW-03 Ensure the organization's software inventory system regularly updates the software inventory via an automated discovery tool.", "nda_tier": "under-nda"}
{"source_doc": "Software_Management_Policy.docx", "section": "General", "text": "SW-04 Ensure the organization's software inventory system correlates the organization's hardware and software inventories in the same system.", "nda_tier": "under-nda"}
{"source_doc": "Software_Management_Policy.docx", "section": "General", "text": "SW-05 Ensure the organization's software inventory system validates that all software in the inventory is still supported by the software vendor.", "nda_tier": "under-nda"}
{"source_doc": "Software_Management_Policy.docx", "section": "General", "text": "SW-06 Ensure the organization's software inventory system validates that all operating system software in the organization's software inventory is kept up to date.", "nda_tier": "under-nda"}
{"source_doc": "Software_Management_Policy.docx", "section": "General", "text": "SW-07 Ensure the organization's software inventory system validates that all application software in the organization's software inventory is kept up to date.", "nda_tier": "under-nda"}
{"source_doc": "Software_Management_Policy.docx", "section": "General", "text": "SW-08 Maintain a Service Level Agreement (SLA) for the organization to define how often software updates must be performed on each software application.", "nda_tier": "under-nda"}
{"source_doc": "Software_Management_Policy.docx", "section": "General", "text": "SW-09 Define a process the organization shall use to ensure all software adheres to the organization's approved software-update Service Level Agreement (SLA).", "nda_tier": "under-nda"}
{"source_doc": "Software_Management_Policy.docx", "section": "General", "text": "SW-10 Maintain a software application control system on each organization's computing systems to ensure that only authorized software can execute.", "nda_tier": "under-nda"}
{"source_doc": "Software_Management_Policy.docx", "section": "General", "text": "SW-11 Ensure the organization's application control system only allows the execution of authorized binaries on each of the organization's computing systems.", "nda_tier": "under-nda"}
{"source_doc": "Software_Management_Policy.docx", "section": "General", "text": "SW-12 Ensure the organization's application control system only allows authorized software libraries (such as DLLs) on each of the organization's computing systems.", "nda_tier": "under-nda"}
{"source_doc": "Software_Management_Policy.docx", "section": "General", "text": "SW-13 Ensure the organization's application control system only allows the use of authorized software scripts on each of the organization's computing systems.", "nda_tier": "under-nda"}
{"source_doc": "Software_Management_Policy.docx", "section": "General", "text": "SW-14 Ensure the organization's application control system only allows the use of authorized operating system shells (such as Microsoft PowerShell or BASH) on each of its computing systems.", "nda_tier": "under-nda"}
{"source_doc": "Software_Management_Policy.docx", "section": "General", "text": "SW-15 Define a process the organization shall use to remove unauthorized software from each of its computing systems in a timely manner.", "nda_tier": "under-nda"}
{"source_doc": "Software_Management_Policy.docx", "section": "General", "text": "Policy Sanctions", "nda_tier": "under-nda"}
{"source_doc": "Software_Management_Policy.docx", "section": "General", "text": "Non-compliance with this policy may result in disciplinary action in line with our corporation's human resources procedures. Consequences may range from mandatory refresher training and written warnings to temporary suspension of remote access privileges and, in severe cases, termination of employment or contractual obligations. Individuals could be subject to legal consequences under applicable laws if violations involve illegal activities. These sanctions emphasize the critical importance of cybersecurity, the individual's role in protecting our digital assets, and the potential risks associated with policy violations. Enforcement will be consistent and impartial, with the severity of the action corresponding directly to the seriousness of the breach.", "nda_tier": "under-nda"}
{"source_doc": "Technology_Equipment_Disposal_Standard.docx", "section": "General", "text": "Technology Equipment Disposal Standard", "nda_tier": "under-nda"}
{"source_doc": "Technology_Equipment_Disposal_Standard.docx", "section": "General", "text": "Purpose", "nda_tier": "under-nda"}
{"source_doc": "Technology_Equipment_Disposal_Standard.docx", "section": "General", "text": "The purpose of this policy it to define the guidelines for the disposal of technology equipment and components owned by GitBug.", "nda_tier": "under-nda"}
{"source_doc": "Technology_Equipment_Disposal_Standard.docx", "section": "General", "text": "Scope", "nda_tier": "under-nda"}
{"source_doc": "Technology_Equipment_Disposal_Standard.docx", "section": "General", "text": "This policy applies to any computer/technology equipment or peripheral devices that are no longer needed within GitBug including, but not limited to the following: personal computers, servers, hard drives, laptops, mainframes, smart phones, or handheld computers ( i.e., Windows Mobile, iOS or Android-based devices), peripherals (i.e., keyboards, mice, speakers), printers, scanners, typewriters, compact and floppy discs, portable storage devices (i.e., USB drives), backup tapes, printed materials. All GitBug employees and affiliates must comply with this policy.", "nda_tier": "under-nda"}
{"source_doc": "Technology_Equipment_Disposal_Standard.docx", "section": "General", "text": "Safeguards", "nda_tier": "under-nda"}
{"source_doc": "Technology_Equipment_Disposal_Standard.docx", "section": "General", "text": "Technology Equipment Disposal", "nda_tier": "under-nda"}
{"source_doc": "Technology_Equipment_Disposal_Standard.docx", "section": "General", "text": "When Technology assets have reached the end of their useful life they should be sent to the <Equipment Disposal Team> office for proper disposal.", "nda_tier": "under-nda"}
{"source_doc": "Technology_Equipment_Disposal_Standard.docx", "section": "General", "text": "The <Equipment Disposal Team> will securely erase all storage mediums in accordance with current industry best practices.", "nda_tier": "under-nda"}
{"source_doc": "Technology_Equipment_Disposal_Standard.docx", "section": "General", "text": "All data including, all files and licensed software shall be removed from equipment using disk sanitizing software that cleans the media overwriting each and every disk sector of the machine with zero-filled blocks, meeting Department of Defense standards.", "nda_tier": "under-nda"}
{"source_doc": "Technology_Equipment_Disposal_Standard.docx", "section": "General", "text": "No computer or technology equipment may be sold to any individual other than through the processes identified in this policy (Section 4.2 below).", "nda_tier": "under-nda"}
{"source_doc": "Technology_Equipment_Disposal_Standard.docx", "section": "General", "text": "No computer equipment should be disposed of via skips, dumps, landfill etc. Electronic recycling bins may be periodically placed in locations around GitBug. These can be used to dispose of equipment. The <Equipment Disposal Team> will properly remove all data prior to final disposal.", "nda_tier": "under-nda"}
{"source_doc": "Technology_Equipment_Disposal_Standard.docx", "section": "General", "text": "All electronic drives must be degaussed or overwritten with a commercially available disk cleaning program. Hard drives may also be removed and rendered unreadable (drilling, crushing or other demolition methods).", "nda_tier": "under-nda"}
{"source_doc": "Technology_Equipment_Disposal_Standard.docx", "section": "General", "text": "Computer Equipment refers to desktop, laptop, tablet or netbook computers, printers, copiers, monitors, servers, handheld devices, telephones, cell phones, disc drives or any storage device, network switches, routers, wireless access points, batteries, backup tapes, etc.", "nda_tier": "under-nda"}
{"source_doc": "Technology_Equipment_Disposal_Standard.docx", "section": "General", "text": "The <Equipment Disposal Team> will place a sticker on the equipment case indicating the disk wipe has been performed. The sticker will include the date and the initials of the technician who performed the disk wipe.", "nda_tier": "under-nda"}
{"source_doc": "Technology_Equipment_Disposal_Standard.docx", "section": "General", "text": "Technology equipment with non-functioning memory or storage technology will have the memory or storage device removed and it will be physically destroyed.", "nda_tier": "under-nda"}
{"source_doc": "Technology_Equipment_Disposal_Standard.docx", "section": "General", "text": "Employee Purchase of Disposed Equipment", "nda_tier": "under-nda"}
{"source_doc": "Technology_Equipment_Disposal_Standard.docx", "section": "General", "text": "Equipment which is working, but reached the end of its useful life to GitBug, will be made available for purchase by employees.", "nda_tier": "under-nda"}
{"source_doc": "Technology_Equipment_Disposal_Standard.docx", "section": "General", "text": "A lottery system will be used to determine who has the opportunity to purchase available equipment.", "nda_tier": "under-nda"}
{"source_doc": "Technology_Equipment_Disposal_Standard.docx", "section": "General", "text": "All equipment purchases must go through the lottery process. Employees cannot purchase their office computer directly or “reserve” a system. This ensures that all employees have an equal chance of obtaining equipment.", "nda_tier": "under-nda"}
{"source_doc": "Technology_Equipment_Disposal_Standard.docx", "section": "General", "text": "Finance and Information Technology will determine an appropriate cost for each item.", "nda_tier": "under-nda"}
{"source_doc": "Technology_Equipment_Disposal_Standard.docx", "section": "General", "text": "All purchases are final. No warranty or support will be provided with any equipment sold.", "nda_tier": "under-nda"}
{"source_doc": "Technology_Equipment_Disposal_Standard.docx", "section": "General", "text": "Any equipment not in working order or remaining from the lottery process will be donated or disposed of according to current environmental guidelines. Information", "nda_tier": "under-nda"}
{"source_doc": "Technology_Equipment_Disposal_Standard.docx", "section": "General", "text": "Technology has contracted with several organizations to donate or properly dispose of outdated technology assets.", "nda_tier": "under-nda"}
{"source_doc": "Technology_Equipment_Disposal_Standard.docx", "section": "General", "text": "Prior to leaving GitBug premises, all equipment must be removed from the Information Technology inventory system.", "nda_tier": "under-nda"}
{"source_doc": "Technology_Equipment_Disposal_Standard.docx", "section": "General", "text": "Policy Sanctions", "nda_tier": "under-nda"}
{"source_doc": "Technology_Equipment_Disposal_Standard.docx", "section": "General", "text": "Non-compliance with this policy may result in disciplinary action in line with our corporation's human resources procedures. Consequences may range from mandatory refresher training and written warnings to temporary suspension of remote access privileges and, in severe cases, termination of employment or contractual obligations. Individuals could be subject to legal consequences under applicable laws if violations involve illegal activities. These sanctions emphasize the critical importance of cybersecurity, the individual's role in protecting our digital assets, and the potential risks associated with policy violations. Enforcement will be consistent and impartial, with the severity of the action corresponding directly to the seriousness of the breach.", "nda_tier": "under-nda"}
{"source_doc": "Vulnerability_Management_Policy.docx", "section": "General", "text": "Vulnerability Management Policy", "nda_tier": "under-nda"}
{"source_doc": "Vulnerability_Management_Policy.docx", "section": "General", "text": "Purpose", "nda_tier": "under-nda"}
{"source_doc": "Vulnerability_Management_Policy.docx", "section": "General", "text": "Our Vulnerability Management Policy aims to establish a systematic and proactive approach for identifying, assessing, prioritizing, and remediating vulnerabilities within our organization's technology infrastructure. This policy aims to provide clear guidelines and procedures for monitoring, analyzing, and mitigating vulnerabilities to reduce the risk of exploitation and unauthorized access. By implementing effective vulnerability management practices, this policy seeks to enhance the security and resilience of our systems, protect sensitive information, and maintain compliance with industry standards and regulatory requirements. Through vulnerability scanning, penetration testing, and vulnerability remediation processes, we strive to identify and address security weaknesses in a timely manner, minimize potential threats, and safeguard the confidentiality, integrity, and availability of our data and networks. By prioritizing vulnerability management, we actively", "nda_tier": "under-nda"}
{"source_doc": "Vulnerability_Management_Policy.docx", "section": "General", "text": "manage risk, improve our overall cybersecurity posture, and ensure the trust and confidence of our stakeholders.", "nda_tier": "under-nda"}
{"source_doc": "Vulnerability_Management_Policy.docx", "section": "General", "text": "Scope", "nda_tier": "under-nda"}
{"source_doc": "Vulnerability_Management_Policy.docx", "section": "General", "text": "The Vulnerability Management Policy applies to all our organization's employees, contractors, and stakeholders and encompasses the proactive identification, assessment, prioritization, mitigation, and monitoring of vulnerabilities within our IT infrastructure. This policy covers all systems, applications, network devices, and endpoints vulnerable to security flaws and weaknesses. It establishes guidelines for vulnerability scanning, penetration testing, risk assessment, and remediation processes. The policy sets forth procedures for vulnerability reporting, tracking, and patch management to ensure timely and effective resolution of identified vulnerabilities. It also defines the roles and responsibilities of individuals involved in vulnerability management processes. Compliance with this policy is mandatory for all individuals within the organization, and any deviations or exceptions require approval from the designated authority responsible for vulnerability management", "nda_tier": "under-nda"}
{"source_doc": "Vulnerability_Management_Policy.docx", "section": "General", "text": "and cybersecurity governance.", "nda_tier": "under-nda"}
{"source_doc": "Vulnerability_Management_Policy.docx", "section": "General", "text": "Safeguards", "nda_tier": "under-nda"}
{"source_doc": "Vulnerability_Management_Policy.docx", "section": "General", "text": "To achieve the organization's overall mission, and the purpose of this cybersecurity policy, the organization shall:", "nda_tier": "under-nda"}
{"source_doc": "Vulnerability_Management_Policy.docx", "section": "General", "text": "VUL-01 Maintain a Vulnerability Management (VM) system to detect and track weaknesses in the organization's information systems.", "nda_tier": "under-nda"}
{"source_doc": "Vulnerability_Management_Policy.docx", "section": "General", "text": "VUL-02 Ensure the organization's Vulnerability Management (VM) system uses agents and/or authenticated scans to detect weaknesses in the organization's information systems.", "nda_tier": "under-nda"}
{"source_doc": "Vulnerability_Management_Policy.docx", "section": "General", "text": "VUL-03 Ensure the organization's Vulnerability Management (VM) system scans for weaknesses caused by outdated, vulnerable software (based on CVEs).", "nda_tier": "under-nda"}
{"source_doc": "Vulnerability_Management_Policy.docx", "section": "General", "text": "VUL-04 Ensure the organization's Vulnerability Management (VM) system scans for weaknesses caused by software misconfigurations (based on CCEs).", "nda_tier": "under-nda"}
{"source_doc": "Vulnerability_Management_Policy.docx", "section": "General", "text": "VUL-05 Ensure the organization's Vulnerability Management (VM) system scans for open, dangerous network ports or services.", "nda_tier": "under-nda"}
{"source_doc": "Vulnerability_Management_Policy.docx", "section": "General", "text": "VUL-06 Ensure the organization's Vulnerability Management (VM) system prioritizes the vulnerabilities it detects in its information systems.", "nda_tier": "under-nda"}
{"source_doc": "Vulnerability_Management_Policy.docx", "section": "General", "text": "VUL-07 Ensure the organization's Vulnerability Management (VM) system compares the results of consecutive vulnerability scans to track the progress of remediation efforts over time.", "nda_tier": "under-nda"}
{"source_doc": "Vulnerability_Management_Policy.docx", "section": "General", "text": "VUL-08 Ensure the organization's Vulnerability Management (VM) system tracks open vulnerabilities in the organization's information systems.", "nda_tier": "under-nda"}
{"source_doc": "Vulnerability_Management_Policy.docx", "section": "General", "text": "VUL-09 Ensure the organization's Vulnerability Management (VM) system tracks approved exceptions when vulnerabilities are discovered on the organization's information systems.", "nda_tier": "under-nda"}
{"source_doc": "Vulnerability_Management_Policy.docx", "section": "General", "text": "VUL-10 Ensure the organization's Vulnerability Management (VM) system reports discovered vulnerabilities to the organization's technical staff regularly.", "nda_tier": "under-nda"}
{"source_doc": "Vulnerability_Management_Policy.docx", "section": "General", "text": "VUL-11 Ensure the organization's Vulnerability Management (VM) system regularly reports discovered vulnerabilities to the organization's business unit staff.", "nda_tier": "under-nda"}
{"source_doc": "Vulnerability_Management_Policy.docx", "section": "General", "text": "VUL-12 Ensure the organization's Vulnerability Management (VM) system reports discovered vulnerabilities to the organization's business leadership staff regularly.", "nda_tier": "under-nda"}
{"source_doc": "Vulnerability_Management_Policy.docx", "section": "General", "text": "Policy Sanctions", "nda_tier": "under-nda"}
{"source_doc": "Vulnerability_Management_Policy.docx", "section": "General", "text": "Non-compliance with this policy may result in disciplinary action in line with our corporation's human resources procedures. Consequences may range from mandatory refresher training and written warnings to temporary suspension of remote access privileges and, in severe cases, termination of employment or contractual obligations. Individuals could be subject to legal consequences under applicable laws if violations involve illegal activities. These sanctions emphasize the critical importance of cybersecurity, the individual's role in protecting our digital assets, and the potential risks associated with policy violations. Enforcement will be consistent and impartial, with the severity of the action corresponding directly to the seriousness of the breach.", "nda_tier": "under-nda"}
